const translation = {
	locales: {
		en: "English",
		fa: "فارسی",
	},
	nav: {
		name: "سینا فاطمی",
		altText: "تایپوگرافی سینا لطفی فاطمی",
		listAbout: "درباره‌من",
		listSkills: "مهارت‌ها",
		listProjects: "پروژه‌ها",
	},
	intro: {
		firstName: "سینـــا",
		lastName: "فاطمــی",
		description: "توسعه‌دهنده فرانت‌اند",
		changeLanguage: "تغییر",
		cancel: "لغو",
		ok: "تایید",
		unknown: "نامشخص",
		affiliate: " آدران",
	},
	sections: {
		about: {
			name: "درباره‌من",
			description:
				"ســـــــــلام 👋، من سینا هستم، مهندس نرم‌افزار ۲۰ ساله که مشتاق یادگیری بیشتر درباره تکنولوژی‌های فرانت‌اند هستم. سعی می‌کنم رابط‌هایی بسازم که به اندازه ظاهرشان احساس خوبی داشته باشند، از طراحی‌های دقیق در فیگما تا اپلیکیشن‌های زنده و واکنش‌گرا در مرورگر",
		},
		education: {
			name: "تحصیلات",
			description:
				"در حال حاضر در رشته علوم کامپیوتر در دانشگاه علم و صنعت ایران (IUST) تحصیل می‌کنم",
		},
		projects: {
			name: "پروژه‌ها",
		},
		skills: {
			name: "مهارت‌ها",
		},
	},
	footer: {
		copyright: "سینا فاطمی",
		builtWith: "ساخته شده با",
		framework: "React.js",
	},
	projects: {
		seeMoreOn: "مشاهده بیشتر در",
		descriptions: {
			fitbit:
				"یک وب اپلیکیشن سبک برای جستجوی تمرینات، مشاهده جزئیات، و نشانه‌گذاری تمرینات مورد علاقه از طریق ExerciseDB API",
			siina: "همین وب‌سایت",
			forkify:
				"یک وب اپلیکیشن دستور پخت که از Forkify API استفاده می‌کند تا به کاربران امکان جستجو، مشاهده، تغییر، نشانه‌گذاری و اضافه کردن دستور پخت را بدهد.",
			codeScraper:
				"یک پلتفرم مدولار برای جمع‌آوری، پردازش و تجزیه و تحلیل داده‌های املاک",
			usePopcorn:
				"یک اپلیکیشن که به کاربران امکان کاوش فیلم‌ها، امتیاز دادن و مدیریت لیست فیلم‌های تماشا شده را می‌دهد.",
			cshot: "یک بازی تیراندازی سریع دو نفره",
			wallWizard: "پیاده‌سازی دقیق بازی رومیزی Quoridor",
		},
	},
	buttons: {
		changeLang: "فا",
	},
};

export { translation };
